Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71/edc/ATSAMV71Q20.PIC
      <edc:SFRDef edc:_addr="0x40038414" edc:access="wwwwwww-------wwwwwwwwww-wwwwwww" edc:cname="USBHS_HSTIDR" edc:impl="0xFE03FF7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DCONNIEC" edc:desc="Device Connection Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIEC" edc:desc="Device Disconnection Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIEC" edc:desc="USB Reset Sent Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIEC" edc:desc="Downstream Resume Sent Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIEC" edc:desc="Upstream Resume Received Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIEC" edc:desc="Host Start of Frame Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIEC" edc:desc="Host Wake-Up Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038418" edc:access="wwwwwww-------wwwwwwwwww-wwwwwww" edc:cname="USBHS_HSTIER" edc:impl="0xFE03FF7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DCONNIES" edc:desc="Device Connection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDISCIES" edc:desc="Device Disconnection Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIES" edc:desc="USB Reset Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSMEDIES" edc:desc="Downstream Resume Sent Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRSMIES" edc:desc="Upstream Resume Received Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSOFIES" edc:desc="Host Start of Frame Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWUPIES" edc:desc="Host Wake-Up Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:desc="Pipe 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:desc="Pipe 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:desc="Pipe 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:desc="Pipe 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:desc="Pipe 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:desc="Pipe 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:desc="Pipe 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:desc="Pipe 7 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:desc="Pipe 8 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:desc="Pipe 9 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:desc="DMA Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:desc="DMA Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:desc="DMA Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:desc="DMA Channel 4 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:desc="DMA Channel 5 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:desc="DMA Channel 6 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:desc="DMA Channel 7 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003841C" edc:access="-------nnnnnnnnn-------nnnnnnnnn" edc:cname="USBHS_HSTPIP" edc:impl="0x1FF01FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="PEN0" edc:desc="Pipe 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN1" edc:desc="Pipe 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN2" edc:desc="Pipe 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN3" edc:desc="Pipe 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN4" edc:desc="Pipe 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN5" edc:desc="Pipe 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN6" edc:desc="Pipe 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN7" edc:desc="Pipe 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN8" edc:desc="Pipe 8 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PRST0" edc:desc="Pipe 0 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST1" edc:desc="Pipe 1 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST2" edc:desc="Pipe 2 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST3" edc:desc="Pipe 3 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST4" edc:desc="Pipe 4 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST5" edc:desc="Pipe 5 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST6" edc:desc="Pipe 6 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST7" edc:desc="Pipe 7 Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRST8" edc:desc="Pipe 8 Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
