Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71/edc/ATSAMV71Q20.PIC
      <edc:SFRDef edc:_addr="0x4004C010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ISI_Y2R_SET0" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C0" edc:desc="Color Space Conversion Matrix Coefficient C0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="C1" edc:desc="Color Space Conversion Matrix Coefficient C1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="C2" edc:desc="Color Space Conversion Matrix Coefficient C2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="C3" edc:desc="Color Space Conversion Matrix Coefficient C3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C014" edc:access="-----------------nnn---nnnnnnnnn" edc:cname="ISI_Y2R_SET1" edc:impl="0x71FF" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C4" edc:desc="Color Space Conversion Matrix Coefficient C4" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="Yoff" edc:desc="Color Space Conversion Luminance Default Offset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Croff" edc:desc="Color Space Conversion Red Chrominance Default Offset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Cboff" edc:desc="Color Space Conversion Blue Chrominance Default Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C018" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="ISI_R2Y_SET0" edc:impl="0x17F7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C0" edc:desc="Color Space Conversion Matrix Coefficient C0" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C1" edc:desc="Color Space Conversion Matrix Coefficient C1" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C2" edc:desc="Color Space Conversion Matrix Coefficient C2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Roff" edc:desc="Color Space Conversion Red Component Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C01C" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="ISI_R2Y_SET1" edc:impl="0x17F7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C3" edc:desc="Color Space Conversion Matrix Coefficient C3" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C4" edc:desc="Color Space Conversion Matrix Coefficient C4" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C5" edc:desc="Color Space Conversion Matrix Coefficient C5" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Goff" edc:desc="Color Space Conversion Green Component Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C020" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="ISI_R2Y_SET2" edc:impl="0x17F7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C6" edc:desc="Color Space Conversion Matrix Coefficient C6" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C7" edc:desc="Color Space Conversion Matrix Coefficient C7" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C8" edc:desc="Color Space Conversion Matrix Coefficient C8" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Boff" edc:desc="Color Space Conversion Blue Component Offset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C024" edc:access="-----------------------w-----www" edc:cname="ISI_CR" edc:impl="0x107" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="ISI_EN" edc:desc="ISI Module Enable Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISI_DIS" edc:desc="ISI Module Disable Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISI_SRST" edc:desc="ISI Software Reset Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ISI_CDC" edc:desc="ISI Codec Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C028" edc:access="----rrrr----r-rr-----r-r-----rrr" edc:cname="ISI_SR" edc:impl="0xF0B0507" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Module Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Module Disable Request has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Module Software Reset Request has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CDC_PND" edc:desc="Pending Codec Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer has Terminated (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIP" edc:desc="Synchronization in Progress" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview Datapath Overflow (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec Datapath Overflow (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="CRC Synchronization Error (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overrun (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C02C" edc:access="----wwww------ww-----w-------ww-" edc:cname="ISI_IER" edc:impl="0xF030406" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Disable Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Software Reset Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview Datapath Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec Datapath Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="Embedded Synchronization CRC Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overflow Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C030" edc:access="----wwww------ww-----w-------ww-" edc:cname="ISI_IDR" edc:impl="0xF030406" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Disable Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Software Reset Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer Done Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview Datapath Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec Datapath Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="Embedded Synchronization CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overflow Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C034" edc:access="----rrrr------rr-----r-------rr-" edc:cname="ISI_IMR" edc:impl="0xF030406" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:desc="Module Disable Operation Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:desc="Software Reset Completed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:desc="Vertical Synchronization" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:desc="Preview DMA Transfer Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:desc="Codec DMA Transfer Completed" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:desc="Preview FIFO Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:desc="Codec FIFO Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:desc="CRC Synchronization Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:desc="Frame Rate Overrun" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C038" edc:access="------------------------------ww" edc:cname="ISI_DMA_CHER" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="P_CH_EN" edc:desc="Preview Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_CH_EN" edc:desc="Codec Channel Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C03C" edc:access="------------------------------ww" edc:cname="ISI_DMA_CHDR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="P_CH_DIS" edc:desc="Preview Channel Disable Request" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_CH_DIS" edc:desc="Codec Channel Disable Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C040" edc:access="------------------------------rr" edc:cname="ISI_DMA_CHSR" edc:impl="0x3" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="P_CH_S" edc:desc="Preview DMA Channel Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C_CH_S" edc:desc="Code DMA Channel Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C044" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="ISI_DMA_P_ADDR" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="P_ADDR" edc:desc="Preview Image Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C048" edc:access="----------------------------nnnn" edc:cname="ISI_DMA_P_CTRL" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="P_FETCH" edc:desc="Descriptor Fetch Control Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P_WB" edc:desc="Descriptor Writeback Control Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P_IEN" edc:desc="Transfer Done Flag Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P_DONE" edc:desc="Preview Transfer Done" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C04C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="ISI_DMA_P_DSCR" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="P_DSCR" edc:desc="Preview Descriptor Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4004C050" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="ISI_DMA_C_ADDR" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="ISI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="C_ADDR" edc:desc="Codec Image Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
