Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71/edc/ATSAMV71Q20.PIC
      <edc:SFRDef edc:_addr="0x40064010" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="AFEC1_SEQ2R" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="USCH8" edc:desc="User Sequence Number 8" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH9" edc:desc="User Sequence Number 9" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH10" edc:desc="User Sequence Number 10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH11" edc:desc="User Sequence Number 11" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064014" edc:access="--------------------wwwwwwwwwwww" edc:cname="AFEC1_CHER" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064018" edc:access="--------------------wwwwwwwwwwww" edc:cname="AFEC1_CHDR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006401C" edc:access="--------------------rrrrrrrrrrrr" edc:cname="AFEC1_CHSR" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064020" edc:access="----rrrr--------rrrrrrrrrrrrrrrr" edc:cname="AFEC1_LCDR" edc:impl="0xF00FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="LDATA" edc:desc="Last Data Converted" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CHNB" edc:desc="Channel Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064024" edc:access="-w---www------------wwwwwwwwwwww" edc:cname="AFEC1_IER" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Enable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Enable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Enable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Enable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Enable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion Interrupt Enable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion Interrupt Enable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion Interrupt Enable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion Interrupt Enable 11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064028" edc:access="-w---www------------wwwwwwwwwwww" edc:cname="AFEC1_IDR" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Disable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Disable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Disable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Disable 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Disable 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Disable 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Disable 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Disable 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion Interrupt Disable 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion Interrupt Disable 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion Interrupt Disable 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion Interrupt Disable 11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006402C" edc:access="-r---rrr------------rrrrrrrrrrrr" edc:cname="AFEC1_IMR" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion Interrupt Mask 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion Interrupt Mask 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion Interrupt Mask 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion Interrupt Mask 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion Interrupt Mask 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion Interrupt Mask 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion Interrupt Mask 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion Interrupt Mask 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion Interrupt Mask 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion Interrupt Mask 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion Interrupt Mask 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion Interrupt Mask 11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064030" edc:access="-r---rrr------------rrrrrrrrrrrr" edc:cname="AFEC1_ISR" edc:impl="0x47000FFF" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="EOC0" edc:desc="End of Conversion 0 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:desc="End of Conversion 1 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:desc="End of Conversion 2 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:desc="End of Conversion 3 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:desc="End of Conversion 4 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:desc="End of Conversion 5 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:desc="End of Conversion 6 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:desc="End of Conversion 7 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:desc="End of Conversion 8 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:desc="End of Conversion 9 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:desc="End of Conversion 10 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:desc="End of Conversion 11 (cleared by reading AFEC_CDRx)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:desc="Data Ready (cleared by reading AFEC_LCDR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:desc="General Overrun Error (cleared by reading AFEC_ISR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:desc="Comparison Error (cleared by reading AFEC_ISR)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:desc="Temperature Change (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
